Repository: AlexanderHalsey/AlexanderHalsey.github.io
Catalog: src/locale/messages.*.xlf
Languages: es, fr

source: SIRET: 922 030 010 00016 – Registered in France 🇫🇷
es: SIRET: 922 030 010 00016 – Registrado en Francia 🇫🇷
fr: SIRET : 922 030 010 00016 – Enregistré en France 🇫🇷

source: Light
es: Luz
fr: Jour

source: Dark
es: Oscuro
fr: Nuit

source: System
es: Sistema
fr: Système

source: About me
es: Sobre mí
fr: À propos

source: Experience
es: Experiencia
fr: Expérience

source: Skills
es: Habilidades
fr: Compétences

source: Contact
es: Contacto

source: Me
es: Yo
fr: Moi

source: Hi there!
es: ¡Hola!
fr: Bonjour !

source: You guessed it—I like Rubik's cubes. But what I’m even more passionate about is coding! I’m a full-stack web developer with a love for building beautiful and functional web applications.
es: Lo adivinaste: me gustan los cubos de Rubik. ¡Pero lo que más me apasiona es programar! Soy un desarrollador web full-stack con un amor por construir aplicaciones web hermosas y funcionales.
fr: Vous l'avez deviné - j'aime les Rubik's cubes. Mais ce qui me passionne encore plus, c'est la programmation ! Je suis un développeur web full-stack avec un amour pour la création d'applications web belles et fonctionnelles.

source: My journey into programming began as a hobby in 2020. I started with little knowledge and a lot of curiosity. Not long after, I had the opportunity to volunteer my newly-acquired skills to create a donation management system for a Buddhist institute. It was a challenging experience filled with mistakes, but each one became a stepping stone for growth.
es: Mi viaje a la programación comenzó como un pasatiempo en 2020. Comencé con poco conocimiento y mucha curiosidad. Poco después, tuve la oportunidad de ofrecer voluntariamente mis habilidades recién adquiridas para crear un sistema de gestión de donaciones para un instituto budista. Fue una experiencia desafiante llena de errores, pero cada uno se convirtió en un peldaño para el crecimiento.
fr: Mon parcours en programmation a commencé comme un passe-temps en 2020. J'ai débuté avec quasi aucune connaissance, mais une grande curiosité. Peu de temps après, j'ai eu l'opportunité de mettre mes compétences nouvellement acquises au service de la création d'un système de gestion des dons pour un institut bouddhiste. Ce fut une expérience enrichissante, remplie d'erreurs, mais chacune est devenue un véritable coup de pouce dans mes apprentissages.

source: Those early days taught me that making mistakes isn’t just part of the process—it’s how we improve. Over time, my passion for problem-solving and creativity in coding has only grown stronger, driving me to constantly learn, experiment, and refine my craft.
es: Esos primeros días me enseñaron que cometer errores no es solo parte del proceso, es cómo mejoramos. Con el tiempo, mi pasión por la resolución de problemas y la creatividad en la programación solo ha crecido, impulsándome a aprender constantemente, experimentar y perfeccionar mi oficio.
fr: Ces premiers jours m'ont appris que faire des erreurs n'est pas seulement une partie du processus - c'est ainsi que nous nous améliorons. Au fil du temps, ma passion pour la résolution de problèmes et la créativité en programmation n'a fait que se renforcer, me poussant à apprendre constamment, à expérimenter et à affiner mon métier.

source: When I’m not coding or solving puzzles, I’m usually exploring new technologies or thinking up creative ways to make the web a better place. Let’s build something amazing together!
es: Cuando no estoy programando o resolviendo acertijos, generalmente estoy explorando nuevas tecnologías o pensando en formas creativas de hacer de la web un lugar mejor. ¡Construyamos algo increíble juntos!
fr: Quand je ne code pas ou ne résous pas de casse-tête, j'explore généralement de nouvelles technologies ou je réfléchis à des moyens créatifs de rendre le web meilleur. Construisons quelque chose d'incroyable ensemble !

source: First Name *
es: Nombre *
fr: Prénom *

source: Last Name *
es: Apellido *
fr: Nom *

source: Phone
es: Teléfono
fr: Téléphone

source: Company
es: Empresa
fr: Entreprise

source: Email *
es: Correo electrónico *

source: Subject *
es: Asunto *
fr: Sujet *

source: Message*
es: Mensaje*

source: Fill out the required fields
es: Complete los campos obligatorios
fr: Remplissez les champs obligatoires

source: Download
es: Descargar
fr: Télécharger

source: Send
es: Enviar
fr: Envoyer

source: Form submitted successfully. I will get back to you as soon as possible.
es: Formulario enviado con éxito. Me pondré en contacto contigo lo antes posible.
fr: Formulaire soumis avec succès. Je vous répondrai dès que possible.

source: Failed to submit form. Please try again later.
es: Error al enviar el formulario. Por favor, inténtalo de nuevo más tarde.
fr: Impossible de soumettre le formulaire. Veuillez réessayer plus tard.

source: Required
es: Requerido
fr: Requis

source: Invalid email
es: Correo electrónico inválido
fr: Email invalide

source: Junior Software Developer
es: Desarrollador de software junior
fr: Développeur logiciel junior

source: I developed back-office microservices to support hospital clients and internal teams, streamlining processes and meeting key performance indicators. <div class="ms-4 mt-4">• <span class="font-medium">Designed</span> and maintained a centralized UI design system for consistency across applications.</div> <div class="ms-4 mt-2">• <span class="font-medium">Collaborated</span> with product owners and peer developers to define project goals and solutions.</div> <div class="ms-4 mt-2">• <span class="font-medium">Implemented</span> CI/CD pipelines with Git, Docker, Kubernetes, and Azure DevOps.</div> <div class="ms-4 mt-2">• <span class="font-medium">Optimized</span> service communication using proxy gateways and load balancers.</div>
es: Desarrollé microservicios de back-office para apoyar a los clientes del hospital y a los equipos internos, optimizando procesos y cumpliendo con los KPIs. <div class="ms-4 mt-4">• <span class="font-medium">Diseñé</span> y mantuve un lib UI centralizado para garantizar la coherencia en todas las aplicaciones.</div> <div class="ms-4 mt-2">• <span class="font-medium">Colaboré</span> con los product owners y los desarrolladores pares para definir los objetivos y soluciones del proyecto.</div> <div class="ms-4 mt-2">• <span class="font-medium">Implementé</span> pipelines de CI/CD con Git, Docker, Kubernetes y Azure DevOps.</div> <div class="ms-4 mt-2">• <span class="font-medium">Optimicé</span> la comunicación de servicios utilizando proxy gateways y load balancers.</div>
fr: J'ai développé des microservices back-office pour soutenir les clients hospitaliers et les équipes internes, rationalisant les processus et répondant aux KPIs. <div class="ms-4 mt-4">• <span class="font-medium">Conçu</span> et maintenu un lib UI centralisé pour une cohérence entre les applications.</div> <div class="ms-4 mt-2">• <span class="font-medium">Collaboré</span> avec les product owners et les développeurs pairs pour définir les objectifs et les solutions du projet.</div> <div class="ms-4 mt-2">• <span class="font-medium">Implémenté</span> des pipelines CI/CD avec Git, Docker, Kubernetes et Azure DevOps.</div> <div class="ms-4 mt-2">• <span class="font-medium">Optimisé</span> la communication des services en utilisant des proxy gateways et des load balancers.</div>

source: Freelance Web Developer
es: Desarrollador web autónomo
fr: Développeur Web Freelance

source: <div>• <span class="font-medium">Built</span> user-friendly interfaces using Vue.js and TypeScript, following SPA design principles.</div> <div class="mt-2">• <span class="font-medium">Wrote</span> pull requests, incorporated feedback, and worked closely with senior developers to improve code quality.</div> <div class="mt-2">• <span class="font-medium">Developed</span> reusable components and maintained clean, well-documented code.</div> <div class="mt-2">• <span class="font-medium">Enhanced</span> reliability with end-to-end and unit tests using Cypress and Jest.</div>
es: <div>• <span class="font-medium">Construí</span> interfaces user-friendly para el usuario utilizando Vue.js y TypeScript, siguiendo los principios de diseño de SPA.</div> <div class="mt-2">• <span class="font-medium">Escribí</span> PRs, incorporé comentarios y trabajé en estrecha colaboración con desarrolladores senior para mejorar la calidad del código.</div> <div class="mt-2">• <span class="font-medium">Desarrollé</span> componentes reutilizables y mantuve un código limpio y bien documentado.</div> <div class="mt-2">• <span class="font-medium">Mejoré</span> la fiabilidad con pruebas de extremo a extremo y unitarias utilizando Cypress y Jest.</div>
fr: <div>• <span class="font-medium">Construit</span> des interfaces user-friendly en utilisant Vue.js et TypeScript, en suivant les principes de conception SPA.</div> <div class="mt-2">• <span class="font-medium">Écrit</span> des PRs, intégré des retours et travaillé en étroite collaboration avec des développeurs seniors pour améliorer la qualité du code.</div> <div class="mt-2">• <span class="font-medium">Développé</span> des composants réutilisables et maintenu un code propre et bien documenté.</div> <div class="mt-2">• <span class="font-medium">Amélioré</span> la fiabilité avec des tests de bout en bout et unitaires en utilisant Cypress et Jest.</div>

source: Registered as a freelancer in France.
es: Registrado como microempresario en Francia.
fr: Enregistré en tant que micro-entrepreneur en France.

source: Software Developer Intern
es: Desarrollador de software en prácticas
fr: Stagiaire Développeur Logiciel

source: <div>• <span class="font-medium">Contributed</span> to backend development using NestJS and PostgreSQL, ensuring efficient data management.</div> <div class="mt-2">• <span class="font-medium">Gained</span> experience working with ORM tools and database optimization.</div> <div class="mt-2">• <span class="font-medium">Assisted</span> in debugging, troubleshooting, and improving application performance.</div> <div class="mt-2">• <span class="font-medium">Learned</span> and applied best practices in software development and team collaboration.</div>
es: <div>• <span class="font-medium">Contribuí</span> al desarrollo del backend utilizando NestJS y PostgreSQL, garantizando una gestión eficiente de los datos.</div> <div class="mt-2">• <span class="font-medium">Adquirí</span> experiencia trabajando con herramientas ORM y optimización de bases de datos.</div> <div class="mt-2">• <span class="font-medium">Ayudé</span> en la depuración, resolución de problemas y mejora del rendimiento de la aplicación.</div> <div class="mt-2">• <span class="font-medium">Aprendí</span> y apliqué las mejores prácticas en el desarrollo de software y la colaboración en equipo.</div>
fr: <div>• <span class="font-medium">Contribué</span> au développement backend en utilisant NestJS et PostgreSQL, assurant une gestion efficace des données.</div> <div class="mt-2">• <span class="font-medium">Acquis</span> de l'expérience en travaillant avec des outils ORM et en optimisant les bases de données.</div> <div class="mt-2">• <span class="font-medium">Aidé</span> dans le débogage, la résolution de problèmes et l'amélioration des performances de l'application.</div> <div class="mt-2">• <span class="font-medium">Appris</span> et appliqué les meilleures pratiques en matière de développement logiciel et de collaboration en équipe.</div>

source: Certificate of Completion – Full-Stack JavaScript Web & Mobile Developer (La Capsule)
es: Certificado de finalización – Desarrollador web y móvil full-stack en JavaScript (La Capsule)
fr: Certificat de fin de formation - Développeur Web & Mobile Full-Stack JavaScript (La Capsule)

source: Volunteer Programmer
es: Programador voluntario
fr: Programmeur Bénévole

source: I developed a donation management system enabled the institute’s admin to track donations, manage donor information, generate individual and annual fiscal PDF receipts, and schedule email dispatches. <div class="ms-4 mt-4">• <span class="font-medium">Python/Django & JavaScript</span> – Backend logic with Django, interactive UI with JavaScript.</div> <div class="ms-4 mt-2">• <span class="font-medium">CRUD functionality</span> – Managed donor and donation records.</div> <div class="ms-4 mt-2">• <span class="font-medium">Frontend & backend integration</span> – Ensured seamless data flow.</div> <div class="ms-4 mt-2">• <span class="font-medium">REST APIs</span> – Secure data retrieval and updates.</div> <div class="ms-4 mt-2">• <span class="font-medium">External libraries</span> – Used for PDFs (ReportLab) and email automation.</div> <div class="ms-4 mt-2 mb-4">• <span class="font-medium">MVC architecture</span> – Maintained clean, scalable code.</div> As a self-taught developer at this stage, I adopted a proactive, problem-solving approach, demonstrating my ability to tackle challenges independently and continuously learn new technologies.
es: Desarrollé un sistema de gestión de donaciones que permitió al administrador del instituto hacer un seguimiento de las donaciones, gestionar la información de los donantes, generar recibos fiscales individuales y anuales en PDF, y programar envíos de correos electrónicos. <div class="ms-4 mt-4">• <span class="font-medium">Python/Django & JavaScript</span> – Lógica del backend con Django, UI interactiva con JavaScript.</div> <div class="ms-4 mt-2">• <span class="font-medium">Funcionalidad CRUD</span> – Gestionó registros de donantes y donaciones.</div> <div class="ms-4 mt-2">• <span class="font-medium">Integración frontend y backend</span> – Garantizó un flujo de datos sin problemas.</div> <div class="ms-4 mt-2">• <span class="font-medium">APIs REST</span> – Recuperación y actualizaciones seguras de datos.</div> <div class="ms-4 mt-2">• <span class="font-medium">Libs externas</span> – Utilizadas para PDFs (ReportLab) y automatización de correos electrónicos.</div> <div class="ms-4 mt-2 mb-4">• <span class="font-medium">Arquitectura MVC</span> – Mantuvo un código limpio y escalable.</div> En esta etapa como desarrollador autodidacta, adopté un enfoque proactivo y resolutivo, demostrando mi capacidad para abordar desafíos de forma independiente y aprender continuamente nuevas tecnologías.
fr: J'ai développé un système de gestion des dons qui a permis à l'administration de l'institut de suivre les dons, de gérer les informations des donateurs, de générer des reçus fiscaux individuels et annuels au format PDF, et de planifier l'envoi d'e-mails. <div class="ms-4 mt-4">• <span class="font-medium">Python/Django & JavaScript</span> - Logique backend avec Django, interface utilisateur interactive avec JavaScript.</div> <div class="ms-4 mt-2">• <span class="font-medium">Fonctionnalité CRUD</span> - Gestion des enregistrements de donateurs et de dons.</div> <div class="ms-4 mt-2">• <span class="font-medium">Intégration frontend & backend</span> - Assuré un flux de données transparent.</div> <div class="ms-4 mt-2">• <span class="font-medium">API REST</span> - Récupération et mises à jour sécurisées des données.</div> <div class="ms-4 mt-2">• <span class="font-medium">Libs externes</span> - Utilisées pour les PDF (ReportLab) et l'automatisation des e-mails.</div> <div class="ms-4 mt-2 mb-4">• <span class="font-medium">Architecture MVC</span> - Maintien d'un code propre et évolutif.</div> À ce stade, en tant que développeur autodidacte, j'ai adopté une approche proactive et axée sur la résolution de problèmes, démontrant ma capacité à relever des défis de manière indépendante et à apprendre continuellement de nouvelles technologies

source: I'm Alex Halsey
es: Soy Alex Halsey
fr: Je suis Alex Halsey

source: A fullstack web developper
es: Un desarrollador web fullstack
fr: Un développeur web fullstack

source: A tech enthusiast
es: Un entusiasta de la tecnología
fr: Un passionné de technologie

source: A problem solver
es: Un solucionador de problemas
fr: Un expert en débrouillardise

source: Web Development
es: Desarrollo web
fr: Développement Web

source: I have experience building frontend applications using frameworks like <span class="font-medium">Vue</span>, <span class="font-medium">Angular</span>, and <span class="font-medium">React</span>, working with state management libraries like <span class="font-medium">Pinia</span> and <span class="font-medium">Redux</span>, and creating responsive designs.
es: Tengo experiencia en la creación de aplicaciones frontend utilizando frameworks como <span class="font-medium">Vue</span>, <span class="font-medium">Angular</span> y <span class="font-medium">React</span>, trabajando con bibliotecas de gestión de estado como <span class="font-medium">Pinia</span> y <span class="font-medium">Redux</span>, y creando diseños receptivos.
fr: J'ai de l'expérience dans la création d'applications frontend en utilisant des frameworks comme <span class="font-medium">Vue</span>, <span class="font-medium">Angular</span> et <span class="font-medium">React</span>, en travaillant avec des bibliothèques de gestion d'état comme <span class="font-medium">Pinia</span> et <span class="font-medium">Redux</span>, et en créant des designs réactifs.

source: Backend Development
es: Desarrollo backend
fr: Développement Backend

source: I have experience building backend services using frameworks like <span class="font-medium">NestJS</span> and <span class="font-medium">Express</span>, working with SQL databases such as <span class="font-medium">PostgreSQL</span>, and integrating with external infrastructure APIs.
es: Tengo experiencia en la creación de servicios backend utilizando frameworks como <span class="font-medium">NestJS</span> y <span class="font-medium">Express</span>, trabajando con bases de datos SQL como <span class="font-medium">PostgreSQL</span>, e integrándome con APIs de infraestructura externa.
fr: J'ai de l'expérience dans la création de services backend en utilisant des frameworks comme <span class="font-medium">NestJS</span> et <span class="font-medium">Express</span>, en travaillant avec des bases de données SQL telles que <span class="font-medium">PostgreSQL</span>, et en intégrant des APIs d'infrastructure externes.

source: E2E Testing
es: Pruebas E2E
fr: Tests E2E

source: I have experience writing end-to-end and unit tests using tools like <span class="font-medium">Cypress</span> and <span class="font-medium">Jest</span>. These tests have been crucial in catching errors when updating solutions, ensuring long-term scalability and reliability.
es: Tengo experiencia escribiendo pruebas de extremo a extremo y unitarias utilizando herramientas como <span class="font-medium">Cypress</span> y <span class="font-medium">Jest</span>. Estas pruebas han sido cruciales para detectar errores al actualizar soluciones, garantizando escalabilidad y fiabilidad a largo plazo.
fr: J'ai de l'expérience dans l'écriture de tests de bout en bout et unitaires en utilisant des outils comme <span class="font-medium">Cypress</span> et <span class="font-medium">Jest</span>. Ces tests ont été cruciaux pour détecter les erreurs lors de la mise à jour des solutions, garantissant une évolutivité et une fiabilité à long terme.

source: Mobile Development
es: Desarrollo móvil
fr: Développement Mobile

source: I have foundational experience in building mobile applications creating solutions for <span class="font-medium">web</span>, <span class="font-medium">iOS</span>, and <span class="font-medium">Android</span> platforms. I gained hands-on experience with React Native during my programming course.
es: Tengo experiencia básica en la creación de aplicaciones móviles creando soluciones para plataformas <span class="font-medium">web</span>, <span class="font-medium">iOS</span> y <span class="font-medium">Android</span>. Adquirí experiencia práctica con React Native durante mi curso de programación.
fr: J'ai une expérience fondamentale dans la création d'applications mobiles en créant des solutions pour les plateformes <span class="font-medium">web</span>, <span class="font-medium">iOS</span> et <span class="font-medium">Android</span>. J'ai acquis une expérience pratique avec React Native lors de mon cours de programmation.

source: Web / UX Design
es: Diseño web / UX
fr: Conception Web / UX

source: I have experience designing websites using tools like <span class="font-medium">Figma</span>, leveraging CSS frameworks such as <span class="font-medium">Tailwind CSS</span>, and working with <span class="font-medium">Material Design</span> libraries, including creating, using, and maintaining them.
es: Tengo experiencia en el diseño de sitios web utilizando herramientas como <span class="font-medium">Figma</span>, aprovechando frameworks de CSS como <span class="font-medium">Tailwind CSS</span>, y trabajando con bibliotecas de <span class="font-medium">Material Design</span>, incluyendo su creación, uso y mantenimiento.
fr: J'ai de l'expérience dans la conception de sites Web en utilisant des outils comme <span class="font-medium">Figma</span>, en tirant parti des frameworks CSS tels que <span class="font-medium">Tailwind CSS</span>, et en travaillant avec des bibliothèques <span class="font-medium">Material Design</span>, y compris leur création, leur utilisation et leur maintenance.

source: CI / CD Pipelines
es: Pipelines CI / CD
fr: Pipelines CI / CD

source: I have a good understanding of CI/CD pipelines and use them to push code within my work’s infrastructure. I also work with <span class="font-medium">Docker</span> and <span class="font-medium">Kubernetes</span>, debugging deployment files and monitoring services.
es: Tengo un buen entendimiento de los pipelines de CI/CD y los utilizo para subir código dentro de la infraestructura de mi trabajo. También trabajo con <span class="font-medium">Docker</span> y <span class="font-medium">Kubernetes</span>, depurando archivos de despliegue y monitoreando servicios.
fr: Je comprends bien les pipelines CI/CD et les utilise pour pousser du code au sein de l'infrastructure de mon travail. Je travaille également avec <span class="font-medium">Docker</span> et <span class="font-medium">Kubernetes</span>, déboguant les fichiers de déploiement et surveillant les services.

source: See less
es: Ver menos
fr: Voir moins

source: See more
es: Ver más
fr: Voir plus
